blog/cloning-a-git-repo-and-it-already-has-a-dirty-working.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>新克隆的仓库，什么都没做，却存在修改，为什么？</title>
<!-- 2020-01-07 Tue 22:30 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Siqing Mu" />
<link rel="shortcut icon" href="https://www.khow.me/blog/images/favicon.ico" /><link rel="stylesheet" type="text/css" href="./css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">新克隆的仓库，什么都没做，却存在修改，为什么？</h1>
<p>
前两天，发现新克隆的一个项目仓库，克隆时就发现，其中有一行警告。git status 之后显示有修改。这就很奇怪了，明明什么都没做，为什么会有修改呢？
</p>

<pre class="example">
warning: the following paths have collided (e.g. case-sensitive paths on a case-insensitive filesystem) and only one from the same colliding group is in the working tree
</pre>

<p>
细看这行警告发现，是路径发生冲突。因为我现在用的是一台Macbook Pro, 它的文件系统是不区分大小写的。所以，当你在同一目录下创建相同文件或文件夹会被告知文件已存在。
</p>

<p>
去gitlab上查看有修改的路径，发现确实是有相同文件名，但是是不同大小写的文件及文件夹。
</p>

<p>
这样，问题就比较清晰了。
</p>

<p>
那为什么会出现这种情况呢。因为这个项目是我和同事共同开发，冲突的那块是因为当时我先写了，他也用生成工具自动生成了。自动生成工具默认文件及文件名都是小写的，而我则采用驼峰之类的命名规范。
这就导致我们各自有一份，在合并到gitlab之后，gitlab并不认为这是两个相同的文件。所以，就保存两者了。然后，因为mac的文件系统是不区分大小写的，它会认为这是同一文件，所以就出现了上面的警告及修改。
</p>

<p>
这里额外说明一点，Linux(ubuntu)是区分大小写的。
</p>

<p>
所以我们由此可以得出结论
</p>

<p>
MacOS 目前使用的文件系统是不区分大小写的，Linux（ubuntu）是区分大小写的。
</p>
</div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
            <script type="text/javascript">
            var disqus_shortname = 'seymer';
            (function() {
                    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
            </script>
            <script>
              (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
                      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
                      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

              ga('create', 'UA-110114842-1', 'auto');
              ga('send', 'pageview');
            </script>
</div>
</body>
</html>